In [1]:
import numpy as np
import pandas as pd

## PRACTICAL ASSIGNMENT - 3

#### Q1 Create a dataframe having at least 3 columns and 50 rows to store numeric data generated using a random function. Replace 10% of the values by null values whose index positions are generated usin random funciton.
##### Do the following

##### (i) Identify and count missing values in a dataframe.

In [20]:
from cmath import nan

df = pd.DataFrame(np.random.randn(150).reshape(50,3),columns=['first','second','third'])
df.index.name = 'SNo.'

#initializing rows(selected randomly) with nan 
#generating random rows value
random_rows = np.random.randint(0,50,5)
print('********OUTPUT**********')
print('Random selected rows :: ',random_rows)

# initializing with nan
df.iloc[random_rows] = nan

'''
(i)
'''
# counting nan values
print('Count of NaN values :: ',df.isna().sum().sum())

********OUTPUT**********
Random selected rows ::  [27  2  0 39 42]
Count of NaN values ::  15

#### another way

In [33]:
'''
=================================================================
'''
df = pd.DataFrame(np.random.randn(150).reshape(50,3),columns=['first','second','third'])
df.index.name = 'SNo.'

# initializing specific elements = nan by generating random row and col index value
random_rows = np.random.randint(0,50,15)
random_cols = np.random.randint(0,3,15)
random_index = list(zip(random_rows,random_cols))
print('********OUTPUT**********')
print('Random selected positions :: ',random_index)

# initializing value at random_index with nan
for x,y in random_index:
    df.iloc[x,y] = nan

print('Count of NaN values :: ',df.isna().sum().sum())

********OUTPUT**********
Random selected positions ::  [(21, 0), (45, 0), (44, 0), (34, 1), (9, 2), (11, 0), (26, 1), (34, 2), (19, 2), (26, 0), (4, 1), (49, 2), (24, 2), (14, 0), (2, 2)]
Count of NaN values ::  15

##### (ii) Drop the column having more than 5 null nalues.
##### (iii) Identify the row label having maximum of the sum of all values in a row and drop that row.
##### (iv) Sort the dataframe on the basis of the first column.
##### (v) Remove all duplicates from the first column.
##### (vi) Find the correlation between first and second column and covariance between second and third column.
##### (vii) Detect the outliers and remove the rows having outliers.
##### (viii) Discretize second column and create 5 bins

In [34]:

'''
(ii)
'''
# count of null values in a column
nullCount = df.isna().sum()
print('\n********OUTPUT**********\n')
print('Count of Nan in each column :: \n',nullCount,'\n')
indx = nullCount[nullCount>5].index
print('Column with count of nan > 5 :: ',list(indx),'\n')
data2 = df.drop(indx,axis=1)

'''
(iii)
'''

# finding sum of each row
data = df.sum(axis=1)

# finding index of the row which have max sum value
max_row_index = data[data == data.max()].index
print('Row index with max sum :: ',max_row_index)
# drop that row
df.drop(max_row_index)

'''
(iv)
'''

display(df.sort_values('first').head(5))

'''
(v)
'''

df.drop_duplicates(subset='first',keep='first')

'''
(vi)
'''
print('Correlation between first and second column :: ')
df_corr = df[['first','second']].corr()
display(df_corr)

print('Covariance between second  and third column :: ')
df_cov = df[['second','third']].cov()
display(df_cov)


'''
(vii)
'''

indx = df[ df['third']< df['third'].mean() + 0.04 ].index
df_new = df.drop(indx)

'''
(viii)
'''
second_col_bins = pd.qcut(df['second'],5)
second_col_bins.value_counts()

********OUTPUT**********

Count of Nan in each column ::
 first     6
second    3
third     6
dtype: int64

Column with count of nan > 5 ::  ['first', 'third']

Row index with max sum ::  Int64Index([48], dtype='int64', name='SNo.')

         first    second     third
SNo.
1    -1.764458  1.502817 -0.156393
22   -1.686682 -0.260987  0.190308
16   -1.589620  1.195365 -0.410557
42   -1.503701 -0.842400 -0.370172
3    -1.280455 -0.528847 -0.325293

Correlation between first and second column ::

           first    second
first   1.000000  0.098013
second  0.098013  1.000000

Covariance between second  and third column ::

          second     third
second  1.257981  0.337624
third   0.337624  0.651944

(-2.824, -0.598]    10
(0.872, 2.474]      10
(-0.598, -0.18]      9
(-0.18, 0.415]       9
(0.415, 0.872]       9
Name: second, dtype: int64

## Q2 Create a dataframe to store marks of M students for n subjects and do the following:
##### (i) Find average marks for each student and add as a column.
##### (ii) Display average marks of each subject and add as a new row.
##### (iii) Compute descriptive statistics subject-wise
##### (iv) Compute grade obtained by each student as per the examination policy of ur course(use lambda function).
##### (v) Find frequency of each grade for your class.
##### (vi) Find frequency of each grade obtained by each student and create a new DF as the following and set Rollno as the row index of the DF.

In [277]:
# list of student names
Name = ['A','B','C','D','E','F','G','H','I','J']

#function generating roll NO.
rollno = []
for i in range(1,11):
    rollno.append('AC-'+str(i))

# creating dataframe
df = pd.DataFrame(np.random.randint(40,101,50).reshape(10,5),columns = ['S1','S2','S3','S4','S5'])
df.insert(0,'Roll_No',rollno,True)
df.insert(1,'Name',Name,True)
df.set_index('Roll_No',drop=True,inplace = True)


'''
(i)
'''
# creating a new column containing average marks of students
df['AVG Marks'] = df.loc[:,'S1':'S5'].mean(axis=1)
print('\n********OUTPUT**********\n')
display(df.head(5))

'''
(ii)
'''
#display average marks of each subject
new_row = df.iloc[:,1:6].mean()
display(new_row)
new_row.name = 'avg'  #add avg marks as new row
df = df.append(new_row).fillna(0)
display(df.tail(2))

'''
(iii)
'''

for i in df.columns[1:6]:
    print('Descriptive statistics of subject',i)
    display(df[i].describe())

'''
(iv)
'''
# DISCRETIZATION
bins = [0,60,70,80,90,95,100]
label = ['D','C','B','B+','A','A+']
student_grades =  pd.cut(df['AVG Marks'],bins,labels = label)
df['Grade'] = student_grades

'''
(v)
'''
print('Frequency of each grade :: ')
display(df['Grade'].value_counts())


'''
(vi)
'''
def grade(i):
    if i>95:
        return 'A+'  
    elif i>90:
        return 'A'
    elif i>80:
        return 'B'
    elif i>70:
        return 'C'
    elif i>60:
        return 'D'
    else:
        return 'E'

f = lambda x: grade(x)

# assign grade for each subject
df.iloc[:,1:6] = df.iloc[:,1:6].applymap(f)
df.drop(['AVG Marks','Grade'],axis=1,inplace = True)

#function to get grade with max freq
f2 = lambda x : x.value_counts().idxmax()
df['Max Grade Obtained'] = df.iloc[:,1:6].apply(f2,axis=1)

# #funtion to get frequency of grade obtained max times
f3 = lambda x : x.value_counts().values[0]
df['Frequency'] = df.iloc[:,1:6].apply(f3,axis=1)

display(df.head(5))

********OUTPUT**********

        Name  S1  S2  S3  S4   S5  AVG Marks
Roll_No
AC-1       A  89  65  85  43   44       65.2
AC-2       B  44  40  94  95   49       64.4
AC-3       C  40  75  94  92   66       73.4
AC-4       D  50  59  71  56   77       62.6
AC-5       E  84  97  46  47  100       74.8

S1    69.3
S2    73.7
S3    71.7
S4    74.6
S5    64.4
dtype: float64

C:\Users\keshav\AppData\Local\Temp\ipykernel_13260\1303320192.py:31: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(new_row).fillna(0)

        Name    S1    S2    S3    S4    S5  AVG Marks
Roll_No
AC-10      J  72.0  97.0  43.0  95.0  62.0       73.8
avg        0  69.3  73.7  71.7  74.6  64.4        0.0

Descriptive statistics of subject S1

count    11.000000
mean     69.300000
std      17.458809
min      40.000000
25%      59.650000
50%      71.000000
75%      84.500000
max      89.000000
Name: S1, dtype: float64

Descriptive statistics of subject S2

count    11.000000
mean     73.700000
std      19.251234
min      40.000000
25%      61.500000
50%      73.700000
75%      92.500000
max      97.000000
Name: S2, dtype: float64

Descriptive statistics of subject S3

count    11.000000
mean     71.700000
std      18.352384
min      43.000000
25%      60.500000
50%      71.000000
75%      89.000000
max      94.000000
Name: S3, dtype: float64

Descriptive statistics of subject S4

count    11.00000
mean     74.60000
std      20.78076
min      43.00000
25%      55.00000
50%      80.00000
75%      93.50000
max      95.00000
Name: S4, dtype: float64

Descriptive statistics of subject S5

count     11.000000
mean      64.400000
std       15.640972
min       44.000000
25%       55.500000
50%       62.000000
75%       71.500000
max      100.000000
Name: S5, dtype: float64

Frequency of each grade ::

B     5
C     4
B+    1
D     0
A     0
A+    0
Name: Grade, dtype: int64

        Name S1  S2 S3 S4  S5 Max Grade Obtained  Frequency
Roll_No
AC-1       A  B   D  B  E   E                  B          2
AC-2       B  E   E  A  A   E                  E          3
AC-3       C  E   C  A  A   D                  A          2
AC-4       D  E   E  C  E   C                  E          3
AC-5       E  B  A+  E  E  A+                 A+          2

## Q3. Input two lists of hobbies where hobbies may be same in two lists as well as a list may have duplicate hobbies. Create a dataseries for the hobbies s.t. hobby type is the index label and count of that hobby is its value.

In [280]:
# creating lists containing hobbies
hobby1 = ['Reading','Dancing','Writing','Singing','Reading','Painting']
hobby2 = ['Painting','Dancing','Reading','Playing','Writing','Singing']

hobby1.extend(hobby2)
new_series = pd.Series(hobby1).value_counts()   #creating series
new_series.index.name = 'hobbies'
print('\n*******OUTPUT*******')
display(new_series)

*******OUTPUT*******

hobbies
Reading     3
Dancing     2
Writing     2
Singing     2
Painting    2
Playing     1
dtype: int64

### Q4. Consider two csv files of students of years 2019 and 2020 having following details (student,name,hobby,course) where courses are (Cshons,bcomhons,PSCS) and hobbies are (writing,painting,music,dancing).Answer the following:

##### i) Find all hobbies types for each course in both years.
##### ii) Find hobbies which are there in 2019 but not in 2020 for each course.
##### iii) Find common hobbies in both year.
##### iv) Find course name in which students are exploring all hobbies.
##### v) Find count of students exploring each hobby in both year

In [100]:
# reading two csv files
from enum import unique


df1 = pd.read_csv('Student_2019.csv')
df2 = pd.read_csv('Student_2020.csv' )


print('\n********OUTPUT**********\n')
display(df1.head(5))

'''
(i)
'''

#display all hobbies types for each course in 2019

df1_new = df1[['Course','Hobby']].drop_duplicates(keep='first')
df1_new = df1_new.set_index(['Course','Hobby'],drop=True)
df1_new = df1_new.sort_index()
display('Hobbies in 2019 :: ',df1_new)  


#display all hobbies types for each course in 2020
df2_new = df2[['Course','Hobby']].drop_duplicates(keep='first')
df2_new = df2_new.set_index(['Course','Hobby'],drop=True)
df2_new = df2_new.sort_index()
display('Hobbies in 2020 :: ',df2_new)  

'''
(ii)
'''

print('Hobbies which are there in 2019 but not in 2020 for each course :: ')
df1_new = df1[['Course','Hobby']].set_index('Course',drop=True)
df2_new = df2[['Course','Hobby']].set_index('Course',drop=True)

for i in df1_new.index.unique():
    df = df1_new.loc[i]
    display(df[~df.isin(df2_new.loc[i].values.flatten())].drop_duplicates())


'''
(iii)
# '''
df1_new = df1[['Course','Hobby']]
df2_new = df2[['Course','Hobby']]
print('Hobbies which are common in both years :: ')
display(df1_new.merge(df2_new).drop_duplicates(keep = 'first').sort_values('Course'))

'''
(iv)
'''
df1_new = df1[['Course','Hobby']].set_index('Course',drop=True)
df2_new = df2[['Course','Hobby']].set_index('Course',drop=True)

print('Course names in which students are exploring all hobbies in 2019 :: ',end=" ")
for i in df1_new.index.unique():
    if (len(df1_new.loc[i]['Hobby'].unique())==4):
        print(i,end=", ")

print('\nCourse names in which students are exploring all hobbies in 2020 :: ',end = " ")
for i in df2_new.index.unique():
    if (len(df2_new.loc[i]['Hobby'].unique())==4):
        print(i,end=", ")



'''
(v)
'''
print('\n\nNumber of students exploring each hobby in 2019 :: ',len(df1['Name'].value_counts()[df1['Name'].value_counts()==4])) 
print('Number of students exploring each hobby in 2020 :: ',len(df2['Name'].value_counts()[df2['Name'].value_counts()==4]))

********OUTPUT**********

  Name     Hobby      Course
0    A   writing        PSCS
1    B   dancing  Bcom(Hons)
2   B1  painting  Bcom(Hons)
3    C   writing        PSCS
4    M     music    Cs(Hons)

'Hobbies in 2019 :: '

Empty DataFrame
Columns: []
Index: [(Bcom(Hons), dancing), (Bcom(Hons), music), (Bcom(Hons), painting), (Bcom(Hons), writing), (Cs(Hons), dancing), (Cs(Hons), music), (Cs(Hons), painting), (Cs(Hons), writing), (PSCS, dancing), (PSCS, painting), (PSCS, writing)]

'Hobbies in 2020 :: '

Empty DataFrame
Columns: []
Index: [(Bcom(Hons), dancing), (Bcom(Hons), music), (Bcom(Hons), writing), (Cs(Hons), dancing), (Cs(Hons), music), (PSCS, dancing), (PSCS, music), (PSCS, painting), (PSCS, writing)]

Hobbies which are there in 2019 but not in 2020 for each course ::

       Hobby
Course
PSCS     NaN

               Hobby
Course
Bcom(Hons)       NaN
Bcom(Hons)  painting

             Hobby
Course
Cs(Hons)       NaN
Cs(Hons)   writing
Cs(Hons)  painting

Hobbies which are common in both years ::

        Course     Hobby
16  Bcom(Hons)   dancing
20  Bcom(Hons)   writing
23  Bcom(Hons)     music
17    Cs(Hons)     music
21    Cs(Hons)   dancing
0         PSCS   writing
19        PSCS   dancing
22        PSCS  painting

Course names in which students are exploring all hobbies in 2019 ::  Bcom(Hons), Cs(Hons),
Course names in which students are exploring all hobbies in 2020 ::  PSCS,

Number of students exploring each hobby in 2019 ::  1
Number of students exploring each hobby in 2020 ::  1

### Q5. Use csv file handling to do the following:
##### a) Read two csv files,remove all rows with any null value. If two files are compatible in terms of record structure combine them and store as in a new file.
##### b) Create a new data frame 'New' storing specified requirement ahead for each column as a row. If column is numeric then maintain mean, median, standard deviation else maintain number of distinct values, value which is appearing maximum time and its count. Assign user -specified row labels.
##### c) Store New DF as an excel file.

In [288]:
df1 = pd.read_csv('StudentMarks_2019.csv')
df2 = pd.read_csv('StudentMarks_2020.csv')

'''
(a)
'''

# remove all rows with any null value
df1.dropna(inplace=True)
df2.dropna(inplace=True)

# drop column SNo. form both dataframes
df1.drop('SNo.',axis=1,inplace=True)
df2.drop('SNo.',axis=1,inplace=True)

# combine dataframes on Roll NO.
df_merged = df1.merge(df2,on='Roll No.')    
df_merged.to_csv('CombinedData.csv',sep='|')
print('\n********OUTPUT**********\n')
display(df_merged.head(5))

'''
(b)
'''

#Creating a dataframe with mean ,median and standard deviation of numeric columns
New = df_merged.describe().iloc[[1,5,2]]

# find unique values, value appearing max times and its frequency for alphanumeric columns
alpha_num = df_merged['Roll No.'].describe()[1:]

# insert alpha_num col at index 0
New.insert(0,'Roll NO.',alpha_num.values)


# assign user defined row labels to indexes
New.index = ['unique / mean','MaxAppear / Median','Freq / Std']
New.index.name = 'Alpha_num / Numeric'        #name of the index column
display(New)

'''
(c)
'''
# storing New dataframe in a excel file
New.to_excel('NewDF.xlsx',sheet_name='sheet1')

********OUTPUT**********

  Roll No.  S1_x  S2_x  S3_x  S1_y  S2_y  S3_y
0     AC-3  92.0  56.0    67  90.0  58.0    14
1     AC-4  70.0   7.0    77  80.0  21.0    94
2     AC-7  12.0  78.0    53  27.0  18.0    32
3     AC-8   5.0  45.0    90   7.0  37.0    79
4     AC-9  23.0   5.0    68  94.0  85.0    47

,Roll NO.,S1_x,S2_x,S3_x,S1_y,S2_y,S3_y
Alpha_num / Numeric,,,,,,,
unique / mean,30,49.533333,52.566667,54.400000,45.000000,49.233333,49.533333
MaxAppear / Median,AC-3,50.000000,56.500000,61.500000,46.000000,49.500000,49.000000
Freq / Std,1,27.755998,29.715529,28.772113,30.136471,29.419303,24.316496

### Q6. Create a database with two tables, where first table is having grades obtained by students in a class and another table is having range of marks for that grade. Use both tables to display average marks for each student(Use database manipulation and retrieval)

In [ ]:
# changing columns names 
df.columns = ['Roll_No','Name','Sub1','Sub2','Sub3','Sub4','Sub5','NetGrade']

In [ ]:
# reset indexes to use Roll_No as a column
df = df.reset_index()
display(df)

  Roll_No Name  S1  S2 S3  S4 S5 AVG Marks
0    AC-1    A  85   D  C   D  E         D
1    AC-2    B  90   D  E   B  B         C
2    AC-3    C  95  A+  E   A  C         B
3    AC-4    D  69  A+  D   C  E         C
4    AC-5    E  55   E  E   B  E         E
5    AC-6    F  49   E  C   E  B         D
6    AC-7    G  40   B  D  A+  A         C
7    AC-8    H  58  A+  D   B  D         C
8    AC-9    I  65   B  D   E  A         C
9   AC-10    J  75   D  B   E  E         D

In [ ]:
# import sqlite database
import sqlite3

# query to create a table containing rollno, name and grade of students
query = """ CREATE TABLE student_grades ( Roll_No VARCHAR(6),
Name VARCHAR(30),
NetGrade VARCHAR(2)
);"""

# connecting to database
con = sqlite3.connect('mydata.sqlite')

# execute query to create the table
# con.execute(query)

# reflect the changes in the database
# con.commit()

# query to insert data from dataframe into student_grades table
stmt = "INSERT INTO student_grades VALUES(?, ?, ?)"

con.executemany(stmt, df[['Roll_No','Name','AVG Marks']].values)

# statement to drop a table
# con.execute('drop table student_grades')
# con.commit()

# query to retrieve data from student_grades table
cursor = con.execute('select * from student_grades')

# display data
rows = cursor.fetchall()
rows

[('AC-1', 'A', 'D'),
 ('AC-2', 'B', 'C'),
 ('AC-3', 'C', 'B'),
 ('AC-4', 'D', 'C'),
 ('AC-5', 'E', 'E'),
 ('AC-6', 'F', 'D'),
 ('AC-7', 'G', 'C'),
 ('AC-8', 'H', 'C'),
 ('AC-9', 'I', 'C'),
 ('AC-10', 'J', 'D')]

In [ ]:
# creating table 2 containing grades and their min ,max values

# dictionary 
table2 = {'Grade' : ['A+','A','B','C','D','E'],
 'MIN' : [95,90,80,70,60,0],
 'MAX' : [100,94,89,79,69,59]
 }

# creating dataframe form dictionary
df_table2 = pd.DataFrame(table2)
display(df_table2)

# query to create table
query = """ CREATE TABLE Grades_Range ( Grade VARCHAR(2),
MIN INT,
MAX INT
);"""

# query execution
# con.execute(query)

# reflect changes in the database
# con.commit()

# insert data from dataframe 'df_table2' into table 'Grades_Range'
stmt = "INSERT INTO Grades_Range VALUES(?, ?, ?)"
con.executemany(stmt,df_table2.values)
con.commit()

  Grade  MIN  MAX
0    A+   95  100
1     A   90   94
2     B   80   89
3     C   70   79
4     D   60   69
5     E    0   59

In [ ]:
# use both the table to show the average marks obtained by students
cursor = con.execute('select Roll_No,Name,NetGrade,(MIN+MAX)/2 from student_grades,Grades_Range where NetGrade == Grade ')

# convert data obtained from the database into a dataframe
display_avgmarks = pd.DataFrame(cursor,columns = ['Roll NO.','Name','Grade Obtained','AVG Marks'])
display(display_avgmarks)     #display data

  Roll NO. Name Grade Obtained  AVG Marks
0     AC-1    A              D         64
1     AC-2    B              C         74
2     AC-3    C              B         84
3     AC-4    D              C         74
4     AC-5    E              E         29
5     AC-6    F              D         64
6     AC-7    G              C         74
7     AC-8    H              C         74
8     AC-9    I              C         74
9    AC-10    J              D         64

### Q7. Given is a folder 'XXX' containing 10 years sec options files of formt csv/xlxs where record structure of each file is same and is as given below:
##### Name of file sec-2015
##### (Rollno,name,course,semester,year,choice1,choice2,choice3)
##### Do the following:
##### a) Find total number of students who have opted first choice as 'Python Programmming' in all files. Choice to be searched and folder path/name needs to be passed as system arguments to the program.
##### b) Compute total number of students filling choices per year. Do not consider duplicate records and records with no choice filled.

In [289]:
# create dataframe
from random import randint

# create values for roll no. column
roll_No = []
for i in range(1421,1441):
    roll_No.append('AC-'+str(i))

# create student names
name = []
for i in range(0,20):
    firstletter = randint(65,90)
    lastletter = randint(97,122)
    name.append(chr(firstletter)+chr(lastletter))

# create course column
course = []
available_courses = ['CS','PSCS','PMCS','IT','Chemistry','Bcom']

for i in range(0,20):
    j = randint(0,5)
    course.append(available_courses[j])

# create semester column
possible_sem = ['I','II','III','IV']
semester = []
for i in range(0,20):
    j = randint(0,3)
    semester.append(possible_sem[j])

# create year column
year = [2017]*20

# create choices columns,i.e,choice1,choice2,choice3
choices = ['Python Programming','Android Programming','Ruby','C++','JAVA']

choice1 = []
choice2 = []
choice3 = []

for i in range(0,20):
    j = randint(0,4)
    choice1.append(choices[j])
    
for i in range(0,20):
    j = randint(0,4)
    choice2.append(choices[j])

for i in range(0,20):
    j = randint(0,4)
    choice3.append(choices[j])


# dataframe creation
df1 = pd.DataFrame({
    'Rollno' : roll_No,
    'Name' : name,
    'Course' : course,
    'Semester' : semester,
    'Year' : year,
    'choice1' : choice1,
    'choice2' : choice2,
    'choice3' : choice3
})
df1.index.name = "SNo."     #set index name
print('\n********OUTPUT**********\n')
display(df1.head())

df1.to_csv('C:\\Users\\keshav\\Semester5\\DAV\\Q7_Files\\sec-2017.csv',sep='|')    #storing dataframe in a csv file

********OUTPUT**********

,Rollno,Name,Course,Semester,Year,choice1,choice2,choice3
SNo.,,,,,,,,
0,AC-1421,Hs,IT,IV,2017,C++,Ruby,Android Programming
1,AC-1422,Of,PMCS,II,2017,Python Programming,Android Programming,Android Programming
2,AC-1423,Ut,IT,II,2017,Python Programming,Ruby,C++
3,AC-1424,Wh,PMCS,IV,2017,C++,Android Programming,Python Programming
4,AC-1425,Zn,PMCS,IV,2017,C++,Python Programming,Ruby

In [291]:
# reading multiple csv files

# list to store dataframe of each file
dataframes_list = []

for i in range(2015,2018):
    temp_df =  pd.read_csv('C:\\Users\\keshav\\Semester5\\DAV\\Q7_Files\sec-'+str(i)+'.csv',sep = '|')
    dataframes_list.append(temp_df)

'''
(a)
'''

# count total number of choices for 'python programming'
total_choices = 0
for i in range(0,3):
    df_temp = dataframes_list[i]['choice1']
    total_choices = total_choices + len(df_temp[df_temp == 'Python Programming'])
print('\n********OUTPUT**********\n')
print('Total number of students who have opted first choice as \'Python Programming\' :: ',total_choices)

'''
(b)
'''
# compute total number of students filling choices per year
for i in range(0,3):
    df_temp = dataframes_list[i].drop_duplicates()
    df = df_temp[['choice1','choice2','choice3']].dropna(how='all')   #drop if all choices are nan
    print('Number of student filled choices in '+ str(2015+i) +' :: ',len(df))

********OUTPUT**********

Total number of students who have opted first choice as 'Python Programming' ::  11
Number of student filled choices in 2015 ::  20
Number of student filled choices in 2016 ::  19
Number of student filled choices in 2017 ::  18

## Q8 Use Web API to download data from URL and display some useful information

In [98]:
import requests

url = 'https://api.covid19india.org/state_district_wise.json'
resp = requests.get(url)

data = resp.json()

# print keys
print(data.keys(),'\n\n')

num = data['Andaman and Nicobar Islands']['districtData']['South Andaman']['confirmed']

print('Confirmed cases of Covid in South Andaman : ',num)

dict_keys(['State Unassigned', 'Andaman and Nicobar Islands', 'Andhra Pradesh', 'Arunachal Pradesh', 'Assam', 'Bihar', 'Chandigarh', 'Chhattisgarh', 'Delhi', 'Dadra and Nagar Haveli and Daman and Diu', 'Goa', 'Gujarat', 'Himachal Pradesh', 'Haryana', 'Jharkhand', 'Jammu and Kashmir', 'Karnataka', 'Kerala', 'Ladakh', 'Lakshadweep', 'Maharashtra', 'Meghalaya', 'Manipur', 'Madhya Pradesh', 'Mizoram', 'Nagaland', 'Odisha', 'Punjab', 'Puducherry', 'Rajasthan', 'Sikkim', 'Telangana', 'Tamil Nadu', 'Tripura', 'Uttar Pradesh', 'Uttarakhand', 'West Bengal'])


{'districtData': {'Nicobars': {'notes': 'District-wise numbers are out-dated as cumulative counts for each district are not reported in bulletin', 'active': 0, 'confirmed': 0, 'migratedother': 0, 'deceased': 0, 'recovered': 0, 'delta': {'confirmed': 0, 'deceased': 0, 'recovered': 0}}, 'North and Middle Andaman': {'notes': 'District-wise numbers are out-dated as cumulative counts for each district are not reported in bulletin', 'active': 0, 'confirmed': 1, 'migratedother': 0, 'deceased': 0, 'recovered': 1, 'delta': {'confirmed': 0, 'deceased': 0, 'recovered': 0}}, 'South Andaman': {'notes': 'District-wise numbers are out-dated as cumulative counts for each district are not reported in bulletin', 'active': 19, 'confirmed': 51, 'migratedother': 0, 'deceased': 0, 'recovered': 32, 'delta': {'confirmed': 0, 'deceased': 0, 'recovered': 0}}, 'Unknown': {'notes': '', 'active': -13, 'confirmed': 7496, 'migratedother': 0, 'deceased': 129, 'recovered': 7380, 'delta': {'confirmed': 0, 'deceased': 0, 'recovered': 0}}}, 'statecode': 'AN'}
Confirmed cases of Covid in South Andaman :  51